export const ABOUT_CONTENT =
  "# Xcode OJ - 在线判题系统\n" +
  "\n" +
  "## 项目介绍\n" +
  "\n" +
  "OJ，即在线判题评测系统，允许用户选择题目进行在线解答。用户可以编写代码并提交至系统，系统将根据出题人设置的答案判断提交的代码结果是否正确。\n" +
  "\n" +
  "## 实现核心\n" +
  "\n" +
  "### 1. 权限校验\n" +
  "- 管理用户提交代码的权限，明确谁可以提交代码，谁不可以。\n" +
  "\n" +
  "### 2. 代码沙箱（安全沙箱）\n" +
  "- **用户代码隔离**：确保用户编写的恶意代码（如木马文件、修改系统权限）不会影响到沙箱之外的系统。\n" +
  "- **资源分配**：限制用户程序的资源占用，防止用户程序占满所有内存，影响其他用户使用。\n" +
  "\n" +
  "### 3. 判题规则\n" +
  "- 通过题目用例比对和结果验证，确保判题的准确性。\n" +
  "\n" +
  "### 4. 任务调度\n" +
  "- 在服务器资源有限的情况下，通过排队和顺序执行判题任务，优化资源分配。\n" +
  "\n" +
  "## 架构设计\n" +
  "![架构设计](https://github.com/wzewei1024/NotePix/raw/master/Project/xoj/image.1kfmhivkde5c.webp)\n" +
  "\n" +
  "## 技术选型\n" +
  "\n" +
  "### 前端\n" +
  "- Vue3\n" +
  "- Acro Design 组件库\n" +
  "- 在线编辑器\n" +
  "- 在线文档浏览\n" +
  "\n" +
  "### 后端\n" +
  "- Java 进程控制、安全管理器、JVM\n" +
  "- 虚拟器（云服务器）\n" +
  "- Docker（代码沙箱实现）\n" +
  "- SpringCloud 微服务\n" +
  "- 消息队列 RabbitMQ\n" +
  "- SpringBoot\n" +
  "- MySQL\n" +
  "\n" +
  "## 项目功能\n" +
  "\n" +
  "### 已有功能\n" +
  "\n" +
  "#### 题目模块\n" +
  "- 创建、删除、修改题目（管理员）\n" +
  "- 搜索题目、在线做题、提交题目代码（用户）\n" +
  "\n" +
  "#### 用户模块\n" +
  "- 注册、登录\n" +
  "- 用户管理（管理员）\n" +
  "\n" +
  "#### 判题模块\n" +
  "- 提交判题、错误处理（内存溢出、安全性、超时）\n" +
  "- 自主实现代码沙箱（安全沙箱）\n" +
  "- 开放接口（提供独立的新服务）\n" +
  "\n" +
  "### 待扩展功能\n" +
  "- 支持多种编程语言\n" +
  "- Remote Judge\n" +
  "- 完善的评测功能（普通测评、特殊测评等）\n" +
  "- 统计分析用户判题记录\n" +
  "- 权限校验\n" +
  "\n" +
  "## 业务流程\n" +
  "![业务流程](https://github.com/wzewei1024/NotePix/raw/master/Project/xoj/image.3dgia74nh4o0.webp)\n" +
  "![时序图](https://github.com/wzewei1024/NotePix/raw/master/Project/xoj/image.2l4f5c5s7nm0.webp)";
